{
  "data": [
    {
      "title": "Start Nuxt and came back",
      "text": "I am the last of the posts, ask questions",
      "date": "27.12.2024"
    },
    {
      "title": "Homepage will be ready soon",
      "text": "There is still a little bit of work left to do on the block with the car model, but the main work is almost finished. In the future, I will only make small, professional edits.",
      "date": "19.01.2025"
    },
    {
      "title": "ThreeJS model ready",
      "text": "Thats was hard, but trully interesting. But I temporarily disabled the display of the ThreeJS model",
      "date": "21.01.2025"
    },
    {
      "title": "Redesign Blog and Library",
      "text": "Added navigation buttons to the Blog page, completely changed the look of the Library page. Of course, this is not the final look of the pages and the site as a whole",
      "date": "24.01.2025"
    },
    {
      "title": "Full redesign of the site",
      "text": "Change the color scheme, add new pages, change the layout of the existing pages. Now the site has a more modern and clean look.",
      "date": "24.01.2025"
    },
    {
      "title": "Design system is ready",
      "text": "I finally finished the design system. Now I can start working on the site. I will add new pages and features to the site, but the main structure is ready. I hope you like it!",
      "date": "26.03.2025"
    },
    {
      "title": "Library page updated",
      "text": "The mobile version doesn't have a clear design yet, and I'll probably add more details",
      "date": "23.04.2025"
    },
    {
      "title": "Start Nuxt and not came back",
      "text": "Finally I did it and switched to Nuxt. It was a bit painful, but I understood that this transition was necessary for further growth and optimization. Now SEO will work perfectly and full-fledged routing will appear",
      "date": "14.07.2025"
    },
    {
      "title": "Whats next hah?",
      "text": "Now I am refactoring the terminal and improving its functionality. I am also creating pages for projects, posts and reviews. And of course, I am wondering if I should refactor the UI again.",
      "date": "20.07.2025"
    },
    {
      "title": "Got new Job with NextJS",
      "text": "New path with React ecosystem. That will be interesting!",
      "date": "21.07.2025"
    }
  ]
}